#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.managed_grafana.data.aws_partition.current: Reading...
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_KEY-test-6-qDqGSE]
data.aws_iam_policy_document.ecs-assume-role-role: Reading...
module.backend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-backend]
module.frontend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-frontend]
aws_ecs_cluster.cc-cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:cluster/community-challenge-cluster]
aws_iam_role.task_role: Refreshing state... [id=community-challenge-task-role]
module.managed_grafana.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.ecs-assume-role-role: Read complete after 0s [id=258469924]
data.aws_iam_group.example: Reading...
aws_iam_policy.ecs-policy: Refreshing state... [id=arn:aws:iam::819383208824:policy/terraform-20231103230851940700000001]
module.log_group-be.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=community-challenge/backend-task/log]
module.log_group-fe.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=community-challenge/frontend-task/log]
module.managed_grafana.data.aws_caller_identity.current: Reading...
module.managed_grafana.data.aws_caller_identity.current: Read complete after 0s [id=819383208824]
aws_secretsmanager_secret.zone: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:ZONE_ID-test-6-yH1opG]
data.aws_iam_group.example: Read complete after 0s [id=AGPA35RYLRN4FOTYWHK3F]
aws_secretsmanager_secret.api_email: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_EMAIL-test-6-KHYCWF]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09138ac5f179eae13]
module.managed_grafana.data.aws_iam_policy_document.assume[0]: Reading...
module.managed_grafana.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=1565249789]
aws_iam_role.ecs_role: Refreshing state... [id=community-challenge-ecs-role]
module.managed_grafana.data.aws_iam_policy_document.this[0]: Reading...
module.managed_grafana.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=374213640]
aws_iam_role_policy.task_policy: Refreshing state... [id=community-challenge-task-role:community-challenge-task_policy]
aws_iam_role_policy_attachment.ecs-policy-att: Refreshing state... [id=community-challenge-ecs-role-20231103230852284200000002]
aws_ecs_task_definition.service: Refreshing state... [id=community-challenge-family]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d1d186fe4b8e1c8a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d96b610a2e716f5c]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0672094fc617eb92b]
aws_lb_target_group.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/6a948e3460b0f1d1]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04ec80a3d6d004f2b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0dbe6f691733f9b99]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0570624e2049f008e]
aws_security_group.lb-sg: Refreshing state... [id=sg-0f35701646b2f2635]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c8b941ca27924bb0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0acb4d72f4e737bf1]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a4d03d79c9b88c19]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-05d14f8b9e61dfecf]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0daac225a5253dbdf]
aws_security_group.ecs-sg: Refreshing state... [id=sg-056c64893416fc471]
aws_lb.ecs-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:loadbalancer/app/community-challenge-lb/41a587d4d6bedfee]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-05d14f8b9e61dfecf1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0362ea1683665d2d5]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06e1d363da37e045f]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e9fbbdc67a76d1c7]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06f88d97ee62c4105]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04fcb69ee307aa752]
aws_security_group.task-endpoint: Refreshing state... [id=sg-069e0d7ffc2a2c5e9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0dbe6f691733f9b991080289494]
aws_ecs_service.cc-service: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:service/community-challenge-cluster/community-challenge-service]
aws_lb_listener.ec-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:listener/app/community-challenge-lb/41a587d4d6bedfee/72acfe6a791d7bb1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_ecs_service.cc-service will be updated in-place
  ~ resource "aws_ecs_service" "cc-service" {
        id                                 = "arn:aws:ecs:us-west-2:819383208824:service/community-challenge-cluster/community-challenge-service"
        name                               = "community-challenge-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:819383208824:task-definition/community-challenge-family:44" -> "arn:aws:ecs:us-west-2:819383208824:task-definition/community-challenge-family:41"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.managed_grafana.aws_grafana_license_association.this[0] will be created
  + resource "aws_grafana_license_association" "this" {
      + free_trial_expiration = (known after apply)
      + id                    = (known after apply)
      + license_expiration    = (known after apply)
      + license_type          = "ENTERPRISE"
      + workspace_id          = (known after apply)
    }

  # module.managed_grafana.aws_grafana_role_association.this["ADMIN"] will be created
  + resource "aws_grafana_role_association" "this" {
      + group_ids    = [
          + "1111111111-abcdefgh-1234-5678-abcd-999999999999",
        ]
      + id           = (known after apply)
      + role         = "ADMIN"
      + workspace_id = (known after apply)
    }

  # module.managed_grafana.aws_grafana_workspace.this[0] will be created
  + resource "aws_grafana_workspace" "this" {
      + account_access_type       = "CURRENT_ACCOUNT"
      + arn                       = (known after apply)
      + authentication_providers  = [
          + "AWS_SSO",
        ]
      + configuration             = (known after apply)
      + data_sources              = [
          + "CLOUDWATCH",
        ]
      + description               = "AWS Managed Grafana service for community challlenge"
      + endpoint                  = (known after apply)
      + grafana_version           = (known after apply)
      + id                        = (known after apply)
      + name                      = "community-challenge-managed-grafana"
      + notification_destinations = [
          + "SNS",
        ]
      + organizational_units      = []
      + permission_type           = "SERVICE_MANAGED"
      + role_arn                  = (known after apply)
      + saml_configuration_status = (known after apply)
      + stack_set_name            = "community-challenge-managed-grafana"
      + tags                      = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
    }

  # module.managed_grafana.aws_grafana_workspace_api_key.this["admin"] will be created
  + resource "aws_grafana_workspace_api_key" "this" {
      + id              = (known after apply)
      + key             = (known after apply)
      + key_name        = "admin"
      + key_role        = "ADMIN"
      + seconds_to_live = 3600
      + workspace_id    = (known after apply)
    }

  # module.managed_grafana.aws_grafana_workspace_api_key.this["editor"] will be created
  + resource "aws_grafana_workspace_api_key" "this" {
      + id              = (known after apply)
      + key             = (known after apply)
      + key_name        = "editor"
      + key_role        = "EDITOR"
      + seconds_to_live = 3600
      + workspace_id    = (known after apply)
    }

  # module.managed_grafana.aws_grafana_workspace_api_key.this["viewer"] will be created
  + resource "aws_grafana_workspace_api_key" "this" {
      + id              = (known after apply)
      + key             = (known after apply)
      + key_name        = "viewer"
      + key_role        = "VIEWER"
      + seconds_to_live = 3600
      + workspace_id    = (known after apply)
    }

  # module.managed_grafana.aws_iam_policy.this[0] will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "community-challenge-managed-grafana-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:GetMetricData",
                          + "cloudwatch:DescribeAlarmsForMetric",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:DescribeAlarmHistory",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingMetricsFromCloudWatch"
                    },
                  + {
                      + Action   = [
                          + "logs:StopQuery",
                          + "logs:StartQuery",
                          + "logs:GetQueryResults",
                          + "logs:GetLogGroupFields",
                          + "logs:GetLogEvents",
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingLogsFromCloudWatch"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingTagsInstancesRegionsFromEC2"
                    },
                  + {
                      + Action   = "tag:GetResources"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingResourcesForTags"
                    },
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sns:*:819383208824:grafana*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
    }

  # module.managed_grafana.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "grafana.amazonaws.com"
                        }
                      + Sid       = "GrafanaAssume"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "community-challenge-managed-grafana-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.managed_grafana.aws_iam_role_policy_attachment.this["this"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @realexcel2021, Action: `pull_request`*